//
//  DefaultExerises.swift
//  Rockout
//
//  Created by Kostya Lee on 17/05/23.
//

import Foundation

public func createDefaultExercises() {
//    let realm = try! Realm()
//    let biceps_hammer = Exercise()
//    biceps_hammer.name = "Молот"
//    biceps_hammer.desc = "Возьмите в руки гантели нейтральным хватом (ладони направлены друг на друга) и встаньте прямо, поставив ноги на ширине 15-20 сантиметров. Руки чуть согнуты в локтях, ноги для устойчивости положения слегка согнуты в коленях. Сделайте вдох и на выдохе не меняя хват поднимите гантели к плечам до упора. Задержитесь в верхней точке на секунду, дополнительно напрягая бицепс, а затем на выдохе медленно опустите гантели вниз. Повторите заданное число раз."
//    biceps_hammer.fileUrl = ""
////        try! realm.write {
////            realm.add(biceps_hammer)
////        }
//    let defaultExercises: [Exercise] = [
//        
//    ]
}

//extension Exercise {
//    static let biceps_hammer = Exercise(
//        name: "Молот",
//        desc: "",
//        fileUrl: "",
//        involvedMuscles:
//    )
//
//    static let biceps_ezBarbellLifting = Exercise(
//        name: "Подьемы ЕЗ штанги на бицепс стоя",
//        desc: "Сделайте глубокий вдох и задержите дыхание. Напрягите бицепсы и поднимите штангу вверх. Как только предплечья примут вертикальное положение, сделайте выдох, остановитесь на мгновение и еще сильнее напрягите бицепсы. Плавно опускайте штангу до тех пор, пока руки почти полностью выпрямятся. Сделайте небольшую паузу и приступайте к следующему повторению.",
//        fileUrl: "",
//        involvedMuscles: ["Двухглавая мышца плеча(бицепс)"]
//    )
//
//    static let biceps_armsBendLBlock = Exercise(
//        name: "Сгибание рук на бицепс на нижнем блоке",
//        desc: "станье лицом к тоенажеоу. возьмите • рукоять так, чтобы ладони были обращены книзу, выпрямитесь, сохраняя естественную позу и держа верхнюю часть туловища неполвижно, локти поижаты к туловишу и не двигаются на протяжении выполнения • всего упражнения. Совет: работают только _поедолечья. часть оуки от плеча по локтя остается неподвижной. Это будет вашим исходным положением. на выдохе, напрягая оицепсы, выполните сгибание рук, пока оицепс полностью не сократится, а рукоять не окажется на уровне гоуди. Слелайте небольшую паузу напоягая мышны на вдохе медленно опустите руки в исходное положение Выполните необходимое количество повторении вариации: вы можете выполнять это упражнение, используя EZ-штангу или штангу с поямым гоифом.",
//        fileUrl: "",
//        involvedMuscles: ["Двухглавая мышца плеча(бицепс)"]
//    )
    
    /// arms:
    /// - молот +
    /// - Подьем ЕЗ штанги +
    /// - сгибание рук на бицепс на нижнем блоке +
    /// - Французкий жим ЕЗ штангой
    /// - отжимания на брусьях
    /// - Разгибание рук на верхнем блоке
    ///
    /// chest:
    /// - жим лежа
    /// - отжимания
    /// - кроссовер на блоке
    /// - Разведения рук с гантелями лежа
    ///
    /// back:
    /// - гиперэкстензия
    /// - подтягивания
    /// - Становая тяга
    /// - тяга верхнего блока
    /// - тяга гантели в наклоне
    ///
    /// abs:
    /// - Скалолаз
    /// - Скручивания
    /// - русский твист
    /// - подьемы ног лежа
    /// - подьем ног к перекладине
    ///
    /// legs:
    /// - Приседания со штангой
    /// - выпады
    /// - Выпрямление ног в тренажере
    /// - Становая тяга
    /// - Жим ногами
    /// - Подьемы на носки
    /// - Подьем ягодиц на штанге опираясь на скамью
    ///
    /// fat burn:
    /// - Планка
    /// - Скакалка
    /// - Бег на дорожке
    /// - Канаты двумя руками
    /// - Гребной тренажер
    /// - Эллиптический тренажер
//}
