Repository: kostya-lee003/Rockout
Catalog: Rockout/Supporting Files/*.lproj/LocalizableExercises.strings
Languages: ru

source: cable incline fly (on stability ball)
ru: кабельные наклонные махи (на мяче для стабильности)

source: ez barbell reverse grip curl
ru: Скручивания с эз-штангой обратным хватом

source: spine twist
ru: скручивание позвоночника

source: cable overhead curl
ru: кабельное скручивание над головой

source: walk elliptical cross trainer
ru: ходьба на эллиптическом тренажере

source: half knee bends (male)
ru: полусогнутые колени (мужчины)

source: dumbbell lying elbow press
ru: жим гантелей лежа на локтях

source: dumbbell one arm lateral raise
ru: Боковой подъем гантелей на одной руке

source: roller hip stretch
ru: растяжка бедер на роликах

source: dumbbell preacher curl over exercise ball
ru: Скручивание гантелей над мячом для упражнений

source: cable reverse crunch
ru: обратный кранч на тросе

source: sled 45в° leg press
ru: жим ногами на санках под углом 45в°

source: cable squat row (with rope attachment)
ru: Приседания на тросе (с креплением на веревке)

source: smith reverse calf raises
ru: обратные икроножные подъемы Смита

source: cable upper row
ru: тросовый верхний ряд

source: kettlebell lunge pass through
ru: проход с гирями

source: barbell pendlay row
ru: штанга для жима лежа

source: kettlebell two arm military press
ru: гиревой жим двумя руками

source: alternate heel touchers
ru: чередование касаний пятки

source: dumbbell reverse bench press
ru: обратный жим гантелей

source: barbell shrug
ru: жим штанги

source: lever reverse hyperextension
ru: обратная гиперэкстензия рычага

source: dumbbell seated one leg calf raise - hammer grip
ru: Подъем икры на одну ногу с гантелями - молотковый хват

source: barbell upright row v. 2
ru: вертикальный ряд со штангой v. 2

source: standing calves
ru: икры стоя

source: dumbbell standing one arm curl over incline bench
ru: разгибание одной руки с гантелями на наклонной скамье

source: twist hip lift
ru: подъем бедра с поворотом

source: weighted standing curl
ru: скручивание стоя с отягощением

source: dumbbell around pullover
ru: разводка гантелей в стороны

source: dumbbell concentration curl
ru: концентрическое скручивание гантелей

source: one arm dip
ru: разгибание одной руки

source: lever one arm bent over row
ru: Рычаг на одной руке в наклоне

source: dumbbell incline fly
ru: махи с гантелями в наклоне

source: bent knee lying twist (male)
ru: Скручивание лежа с согнутыми коленями (мужчины)

source: reclining big toe pose with rope
ru: Поза большого пальца ноги со скакалкой

source: lever t bar row
ru: рычажный турник

source: cable curl
ru: кабельное скручивание

source: sled 45 degrees one leg press
ru: жим одной ноги на санках под углом 45 градусов

source: exercise ball prone leg raise
ru: подъем ног на мяче

source: smith incline shoulder raises
ru: Наклонные подъемы плеч по Смиту

source: cable lying fly
ru: кабельные махи лежа

source: forward lunge (male)
ru: выпад вперед (мужчина)

source: dumbbell incline row
ru: наклонный ряд с гантелями

source: weighted pull-up
ru: подтягивание с отягощением

source: hug keens to chest
ru: подтягивания к груди

source: dumbbell lying supination
ru: супинация гантелей лежа

source: band straight leg deadlift
ru: подтягивание на прямых ногах с лентой

source: push-up (wall) v. 2
ru: отжимание (от стены) v. 2

source: dumbbell one arm standing curl
ru: Скручивание гантелей на одной руке стоя

source: side bridge hip abduction
ru: боковой мост - абдукция бедра

source: cable russian twists (on stability ball)
ru: Кабельные русские скручивания (на мяче для устойчивости)

source: band seated hip internal rotation
ru: внутреннее вращение бедра в приседе с лентой

source: inverse leg curl (on pull-up cable machine)
ru: обратное разгибание ног (на тросовом тренажере для подтягиваний)

source: cable standing shoulder external rotation
ru: внешнее вращение плеча на тросе

source: snatch pull
ru: рывок гири

source: kettlebell alternating hang clean
ru: попеременное подтягивание с гирей

source: barbell lunge
ru: выпад со штангой

source: chin-ups (narrow parallel grip)
ru: подтягивания (узким параллельным хватом)

source: barbell reverse grip incline bench press
ru: жим штанги обратным хватом на наклонной скамье

source: lever bent over row
ru: рычажный гриф

source: dumbbell seated bent over alternate kickback
ru: попеременный откат гантели с наклоном вперед

source: barbell standing close grip curl
ru: Скручивание штанги стоя узким хватом

source: dumbbell single leg split squat
ru: Приседания с гантелями на одной ноге

source: dumbbell sumo pull through
ru: тяга гантели сумо

source: dead bug
ru: мёртвый жук

source: barbell decline bent arm pullover
ru: Сгибание рук со штангой

source: band front raise
ru: подтягивания на перекладине

source: lying leg raise flat bench
ru: подъем ног лежа на плоской скамье

source: kettlebell turkish get up (squat style)
ru: гиревой турник (приседания)

source: dumbbell fly
ru: махи гантелей

source: bodyweight standing row (with towel)
ru: гребля стоя с весом тела (с полотенцем)

source: rope climb
ru: лазание по канату

source: one arm against wall
ru: упирание одной рукой в стену

source: elevator
ru: лифт

source: cable incline fly
ru: кабельные наклонные махи

source: ez barbell jm bench press
ru: жим штанги лежа

source: spine stretch
ru: растяжка позвоночника

source: cable one arm tricep pushdown
ru: тросовый жим на трицепс одной рукой

source: vertical leg raise (on parallel bars)
ru: Вертикальный подъем ног (на параллельных брусьях)

source: hack one leg calf raise
ru: подъемы икроножных на одну ногу

source: assisted standing chin-up
ru: подтягивания стоя

source: dumbbell lying alternate extension
ru: попеременное разгибание гантелей лежа

source: dumbbell one arm kickback
ru: разгибание рук с гантелями

source: assisted hanging knee raise with throw down
ru: подъем колена в висе с отбрасыванием вниз

source: roller hip lat stretch
ru: разгибание бедра на роликах

source: dumbbell preacher curl
ru: разгибание гантелей

source: cable rear pulldown
ru: кабельное подтягивание

source: band single leg calf raise
ru: подъем икры на одну ногу с лентой

source: sled 45в° calf press
ru: жим на санях для икроножных под углом 45в°

source: band one arm single leg split squat
ru: приседание с одной рукой на одной ноге

source: cable side crunch
ru: кабельный боковой кранч

source: cable upper chest crossovers
ru: кабельные кроссоверы для верхней части груди

source: kettlebell hang clean
ru: гиревой турник

source: barbell palms up wrist curl over a bench
ru: Разгибание рук со штангой на скамье

source: kettlebell two arm clean
ru: гиревой комплекс на две руки

source: all fours squad stretch
ru: растяжка на четвереньках

source: dumbbell revers grip biceps curl
ru: разгибание гантелей на бицепс обратным хватом

source: barbell seated twist
ru: присед со штангой

source: lever reverse grip vertical row
ru: Рычаг обратным хватом вертикальный ряд

source: dumbbell seated one leg calf raise
ru: Подъем икры на одну ногу с гантелями

source: barbell upright row
ru: вертикальный ряд со штангой

source: barbell full squat (back pov)
ru: Приседания со штангой (на спине)

source: standing calf raise (on a staircase)
ru: подъемы на икры стоя (на лестнице)

source: dumbbell standing one arm curl (over incline bench)
ru: Скручивание одной руки с гантелями (на наклонной скамье)

source: twin handle parallel grip lat pulldown
ru: подтягивания с двумя рукоятками параллельным хватом

source: weighted squat
ru: приседание с отягощением

source: dumbbell arnold press v. 2
ru: жим гантели арнольда v. 2

source: dumbbell close-grip press
ru: жим гантелей узким хватом

source: band assisted pull-up
ru: подтягивание с помощью ленты

source: kneeling jump squat
ru: прыжковое приседание на колени

source: olympic barbell hammer curl
ru: разгибание олимпийской штанги

source: back lever
ru: задний рычаг

source: lever narrow grip seated row
ru: рычаг узким хватом сидячий ряд

source: dumbbell incline curl v. 2
ru: Скручивание гантелей в наклоне v. 2

source: bench pull-ups
ru: подтягивания на скамье

source: push-up to side plank
ru: отжимание до боковой планки

source: lever standing chest press
ru: жим от груди стоя

source: cable cross-over variation
ru: вариация перекрещивания тросов

source: skin the cat
ru: снять шкуру с кошки

source: smith incline reverse-grip press
ru: Наклонный жим обратным хватом

source: exercise ball pike push up
ru: отжимания на мяче

source: cable lying extension pullover (with rope attachment)
ru: пуловер на тросе для разгибания лежа (с креплением веревки)

source: forward jump
ru: прыжок вперёд

source: tuck crunch
ru: подтянутый кранч

source: weighted overhead crunch (on stability ball)
ru: кранч с отягощением (на мяче для стабильности)

source: hip raise (bent knee)
ru: подъем бедра (согнутое колено)

source: dumbbell lying single extension
ru: разгибание гантелей лежа

source: push-up (wall)
ru: отжимание (от стены)

source: dumbbell one arm snatch
ru: рывок гантели одной рукой

source: shoulder tap push-up
ru: отжимание от плеча

source: cable rope seated row
ru: присед на тросе

source: inverse leg curl (bench support)
ru: обратное разгибание ног (опора на скамью)

source: cable standing row (v-bar)
ru: тросовый жим стоя (v-bar)

source: smith wide grip decline bench press
ru: жим лежа широким хватом смита

source: kettlebell advanced windmill
ru: гиревой комплекс ветряная мельница

source: barbell low bar squat
ru: приседания со штангой

source: chin-up
ru: подтягивания

source: barbell reverse grip decline bench press
ru: жим штанги лежа обратным хватом

source: lever back extension
ru: разгибание спины

source: dumbbell seated bent arm lateral raise
ru: Боковой подъем гантелей в приседе на согнутые руки

source: barbell standing calf raise
ru: Подъем икры со штангой

source: dumbbell single leg deadlift with stepbox support
ru: Подъем гантелей на одну ногу с опорой на степбокс

source: barbell decline wide-grip press
ru: Жим штанги широким хватом

source: dumbbell straight leg deadlift
ru: Подъем гантелей на прямые ноги

source: cycle cross trainer
ru: кросс-тренажер

source: lunge with jump
ru: выпад с прыжком

source: dumbbell finger curls
ru: разгибание пальцев с гантелями

source: push-up (on stability ball)
ru: отжимание (на мяче для устойчивости)

source: dumbbell incline rear lateral raise
ru: Подъем гантелей с наклоном назад

source: bodyweight standing row
ru: гребля стоя с весом тела

source: roller side lat stretch
ru: боковая растяжка лат на роликах

source: olympic barbell triceps extension
ru: разгибание трицепса с олимпийской штангой

source: elbow-to-knee
ru: разгибание локтя к колену

source: cable incline bench row
ru: кабельный наклонный ряд

source: smith full squat
ru: полное приседание Смита

source: ez barbell incline triceps extension
ru: разгибание на трицепс со штангой

source: spider crawl push up
ru: отжимания пауком

source: cable one arm straight back high row (kneeling)
ru: Кабельные подтягивания на одной руке с прямой спиной (стоя на коленях)

source: hack calf raise
ru: подъём икры

source: dumbbell lying extension (across face)
ru: Разгибание гантелей лежа (через лицо)

source: dumbbell one arm incline chest press
ru: жим гантелей от груди с наклоном на одну руку

source: roller body saw
ru: роликовая пила для тела

source: dumbbell plyo squat
ru: приседание с гантелями

source: cable rear drive
ru: тросовый задний привод

source: ski ergometer
ru: лыжный эргометр

source: cable side bend crunch (bosu ball)
ru: Хруст с боковым изгибом на тросе (мяч босу)

source: smith rear delt row
ru: разводка задних дельт смита

source: cable underhand pulldown
ru: подтягивания на тросе

source: kettlebell goblet squat
ru: приседание с гирей

source: barbell palms down wrist curl over a bench
ru: Скручивание запястий на скамье со штангой ладонями вниз

source: dumbbell rear lunge
ru: задний выпад с гантелями

source: barbell seated overhead triceps extension
ru: разгибание на трицепс со штангой

source: lever reverse grip preacher curl
ru: разгибание рычага обратным хватом

source: dumbbell seated one arm rotate
ru: присед с гантелями на одной руке

source: barbell thruster
ru: тяга штанги

source: standing behind neck press
ru: жим стоя за шеей

source: dumbbell standing one arm concentration curl
ru: концентрические скручивания гантелей стоя на одной руке

source: weighted sissy squat
ru: приседание с отягощением

source: dumbbell arnold press
ru: жим гантелей Арнольда

source: dumbbell close grip press
ru: жим гантелей узким хватом

source: oblique crunches floor
ru: Косые кранчи на полу

source: bench hip extension
ru: разгибание бедра на скамье

source: dumbbell incline curl
ru: наклонное скручивание гантелей

source: lever military press
ru: рычажный военный жим

source: lever standing calf raise
ru: подъем икроножных на рычаге

source: cable cross-over revers fly
ru: перекрестные махи на тросах

source: ski step
ru: лыжный шаг

source: exercise ball one legged diagonal kick hamstring curl
ru: упражнение с мячом на одной ноге диагональный удар подколенное скручивание

source: cable lying close-grip curl
ru: разгибание рук лежа с близким хватом

source: flutter kicks
ru: флаттер кик

source: triceps stretch
ru: растяжка трицепса

source: weighted one hand pull up
ru: Подтягивания на одной руке с отягощением

source: high knee against wall
ru: Подъем колена к стене

source: wind sprints
ru: ветряные спринты

source: dumbbell lying rear lateral raise
ru: Подъем гантелей лежа на спине

source: assisted prone rectus femoris stretch
ru: растяжка прямой мышцы бедра

source: barbell bench front squat
ru: Передние приседания со штангой

source: assisted lying leg raise with throw down
ru: Подъем ног лежа с броском вниз

source: dumbbell one arm shoulder press v. 2
ru: жим гантелей на одну руку с плеч v. 2

source: band standing crunch
ru: кранч с лентой стоя

source: shoulder tap
ru: плечевой кран

source: cable rope one arm hammer preacher curl
ru: разгибание одной руки с тросом

source: band seated twist
ru: сна одной руке с отягощением

source: intermediate hip flexor and quad stretch
ru: промежуточная растяжка сгибателей бедра и квадрицепсов

source: cable standing reverse grip one arm overhead tricep extension
ru: разгибание трицепса на тросе стоя обратным хватом одной рукой

source: smith wide grip bench press
ru: жим лежа широким хватом

source: jump squat v. 2
ru: прыжковые приседания v. 2

source: barbell lateral lunge
ru: боковой выпад со штангой

source: chest tap push-up (male)
ru: отжимание от груди (мужчины)

source: kettlebell swing
ru: гиревой спорт

source: barbell reverse grip bent over row
ru: разгибание штанги обратным хватом

source: lever assisted chin-up
ru: подтягивание с помощью рычага

source: dumbbell seated bench extension
ru: разгибание сна одной руке с отягощением

source: barbell standing bradford press
ru: жим штанги стоя

source: dumbbell single leg deadlift
ru: подъемы гантелей на одну ногу

source: triceps dip
ru: разводка на трицепс

source: band one arm overhead biceps curl
ru: Разгибание бицепса на одной руке

source: band kneeling twisting crunch
ru: Скручивания с лентой на коленях

source: dumbbell straight arm pullover
ru: пуловер с гантелями на прямых руках

source: curtsey squat
ru: приседание со скручиванием

source: barbell curl
ru: скручивание со штангой

source: lower back curl
ru: разгибание в пояснице

source: dumbbell decline twist fly
ru: махи с гантелями в наклоне

source: push-up (bosu ball)
ru: отжимание (мяч босу)

source: dumbbell incline raise
ru: подъем гантелей в наклоне

source: bodyweight standing one arm row (with towel)
ru: Подтягивание на одной руке с весом тела (с полотенцем)

source: roller back stretch
ru: растяжка спины на роликах

source: modified hindu push-up (male)
ru: модифицированный индусский отжим (мужчина)

source: elbow lift - reverse push-up
ru: подъем локтей - обратное отжимание

source: cable incline bench press
ru: жим на наклонной скамье

source: smith front squat (clean grip)
ru: передние приседания смита (чистый хват)

source: ez barbell decline triceps extension
ru: разгибание трицепса со штангой

source: cable one arm reverse preacher curl
ru: обратные разгибания на одной руке

source: groin crunch
ru: паховый кранч

source: dumbbell lunge with bicep curl
ru: Выпады с гантелями и разгибание на бицепс

source: dumbbell one arm hammer press on exercise ball
ru: Жим гантелей одной рукой на гимнастическом мяче

source: band twisting overhead press
ru: Скручивание ленты в верхнем жиме

source: reverse hyper on flat bench
ru: обратный гипер на плоской скамье

source: dumbbell peacher hammer curl
ru: Скручивание гантели с молотом

source: cable rear delt row (with rope)
ru: разводка задних дельт на тросе (с веревкой)

source: skater hops
ru: прыжки конькобежца

source: cable side bend
ru: кабельный боковой сгиб

source: smith machine incline tricep extension
ru: разгибание трицепса в наклоне на тренажере Смита

source: cable two arm tricep kickback
ru: кабельный двуручный трицепс-кикбэк

source: kettlebell front squat
ru: передние приседания с гирей

source: barbell overhead squat
ru: верхнее приседание со штангой

source: dumbbell rear lateral raise (support head)
ru: Боковой подъем гантелей (поддерживая голову)

source: barbell seated overhead press
ru: верхний жим штанги сидя

source: lever overhand triceps dip
ru: Рычаг для разгибания рук на трицепс

source: dumbbell seated one arm kickback
ru: разгибание рук с гантелями

source: barbell sumo deadlift
ru: мертвая тяга со штангой

source: standing archer
ru: стоячий лучник

source: dumbbell standing kickback
ru: жим гантелей стоя

source: weighted side bend (on stability ball)
ru: боковой сгиб с отягощением (на мяче для стабильности)

source: band hip lift
ru: подъём бедра с лентой

source: dumbbell alternating seated bicep curl on exercise ball
ru: Попеременное разгибание бицепса с гантелями на гимнастическом мяче

source: band bicycle crunch
ru: Велосипедный кранч с лентой

source: dumbbell clean
ru: чистка гантелей

source: dumbbell incline breeding
ru: разведение гантелей в наклоне

source: oblique crunch v. 2
ru: косой кранч v. 2

source: bench dip on floor
ru: разводка на скамье на полу

source: back pec stretch
ru: растяжка грудных мышц спины

source: lever lateral raise
ru: боковой подъем рычага

source: lever shrug
ru: рычажные плечи

source: cable cross-over lateral pulldown
ru: тросовый кросс-овер боковой пулдаун

source: sit-up with arms on chest
ru: приседание с руками на груди

source: exercise ball one leg prone lower body rotation
ru: Вращение нижней части тела на мяче для упражнений на одной ноге

source: cable lying bicep curl
ru: разгибание бицепса на тросе лежа

source: floor fly (with barbell)
ru: махи на полу (со штангой)

source: triceps press
ru: жим на трицепс

source: assisted wide-grip chest dip (kneeling)
ru: наклоны к груди с широким хватом (стоя на коленях)

source: weighted muscle up (on bar)
ru: подтягивания с отягощением (на перекладине)

source: hanging straight twisting leg hip raise
ru: разведение прямых ног в висе

source: wide-grip chest dip on high parallel bars
ru: наклоны к груди широким хватом на высоких параллельных брусьях

source: dumbbell lying rear delt row
ru: разводка гантелей лежа на задних дельтах

source: dumbbell one arm shoulder press
ru: жим гантелей на одну руку

source: shoulder grip pull-up
ru: подтягивание хватом за плечи

source: cable rope lying on floor tricep extension
ru: разгибание трицепса на тросе лежа на полу

source: incline twisting sit-up
ru: наклонный скручивающийся присед

source: cable standing rear delt row (with rope)
ru: разводка задних дельт на тросе (с тросом)

source: smith upright row
ru: вертикальный ряд Смита

source: jump squat
ru: прыжковое приседание

source: barbell jump squat
ru: прыжковое приседание со штангой

source: chest stretch with exercise ball
ru: растяжка груди с мячом для упражнений

source: kettlebell sumo high pull
ru: тяга сумо с гирей

source: barbell reverse curl
ru: обратное скручивание со штангой

source: lever alternating narrow grip seated row
ru: попеременное выполнение приседаний узким хватом

source: dumbbell seated alternate shoulder
ru: присед с гантелями на разные плечи

source: barbell standing back wrist curl
ru: Разгибание рук со штангой стоя

source: dumbbell single leg calf raise
ru: Подъем гантелей на одну ногу

source: trap bar deadlift
ru: мертвая тяга со штангой

source: dumbbell stiff leg deadlift
ru: Подъем гантелей на жесткие ноги

source: curl-up
ru: скручивания

source: weighted russian twist (legs up)
ru: русское скручивание с отягощением (ноги вверх)

source: low glute bridge on floor
ru: низкий ягодичный мостик на полу

source: dumbbell decline triceps extension
ru: разгибание трицепса с гантелями

source: push to run
ru: толчок к бегу

source: dumbbell incline press on exercise ball
ru: жим гантелей в наклоне на гимнастическом мяче

source: bodyweight standing one arm row
ru: гребля на одной руке стоя с весом тела

source: rocky pull-up pulldown
ru: подтягивания со скалкой

source: mixed grip chin-up
ru: подтягивания смешанным хватом

source: elbow dips
ru: наклоны к локтям

source: cable hip adduction
ru: разведение бедер на тросе

source: smith decline reverse-grip press
ru: жим штанги смита обратным хватом

source: ez barbell decline close grip face press
ru: жим штанги лежа с закрытым хватом

source: cable one arm pulldown
ru: тросовый одноручный жим

source: gorilla chin
ru: подбородок гориллы

source: dumbbell lunge
ru: выпад с гантелями

source: dumbbell one arm hammer preacher curl
ru: разгибание гантели на одной руке

source: push-up
ru: отжимание

source: assisted lying calves stretch
ru: растяжка икр лежа

source: reverse hyper extension (on stability ball)
ru: обратная гиперэкстензия (на мяче для стабильности)

source: dumbbell palms in incline bench press
ru: жим на наклонной скамье с гантелями в ладонях

source: cable rear delt row (stirrups)
ru: разводка задних дельт на тросах (в стременах)

source: sit-up v. 2
ru: приседание v. 2

source: cable shrug
ru: кабельные плечи

source: smith machine decline close grip bench press
ru: жим лежа с использованием тренажера Смита

source: cable two arm curl on incline bench
ru: Скручивание двух рук на наклонной скамье

source: kettlebell figure 8
ru: гиревая фигура 8

source: barbell hack squat
ru: приседания со штангой

source: barbell one leg squat
ru: приседания со штангой на одной ноге

source: barbell seated good morning
ru: присед со штангой

source: lever one arm shoulder press
ru: жим одной рукой на плечи

source: dumbbell seated one arm bicep curl on exercise ball with leg raised
ru: Скручивания на бицепс с гантелями на мяче с поднятой ногой

source: barbell straight leg deadlift
ru: мертвая тяга со штангой на прямых ногах

source: stalder press
ru: становой жим

source: dumbbell standing inner biceps curl v. 2
ru: Разгибание гантелей на бицепс стоя с внутренней стороны v. 2

source: dumbbell alternating bicep curl with leg raised on exercise ball
ru: попеременное разгибание гантелей на бицепс с поднятой ногой на гимнастическом мяче

source: negative crunch
ru: негативный кранч

source: dumbbell incline biceps curl
ru: разгибание на бицепс с гантелями в наклоне

source: bench dip (knees bent)
ru: наклоны к скамье (колени согнуты)

source: lever kneeling twist
ru: скручивания на коленях

source: lever shoulder press v. 3
ru: жим от рычага на плечи v. 3

source: cable concentration extension (on knee)
ru: концентрическая растяжка на тросе (на коленях)

source: side wrist pull stretch
ru: боковая растяжка запястья
