Repository: kostya-lee003/Rockout
Catalog: Rockout/Supporting Files/*.lproj/LocalizableExercises.strings
Languages: ru

source: weighted kneeling step with swing
ru: Шаг с отягощением на коленях с поворотом

source: dumbbell biceps curl (with arm blaster)
ru: Разгибание гантелей на бицепс (с армбластером)

source: dumbbell decline hammer press
ru: жим гантелей в наклоне

source: power clean
ru: силовая чистка

source: dumbbell incline one arm hammer press on exercise ball
ru: Наклонный жим гантелей одной рукой на гимнастическом мяче

source: bodyweight squatting row
ru: приседания с весом тела

source: reverse dip
ru: обратный выпад

source: medicine ball chest push single response
ru: Жим от груди с медицинским мячом в одной позиции

source: cable front raise
ru: кабельный фронтальный подъем

source: smith bent over row
ru: наклоны смита

source: ez bar standing french press
ru: французский жим стоя на перекладине

source: cable one arm incline press on exercise ball
ru: Наклонный жим одной рукой на гимнастическом мяче

source: full planche push-up
ru: отжимание на брусьях

source: dumbbell kickback
ru: отжимание с гантелями

source: dumbbell one arm chest fly on exercise ball
ru: махи одной рукой с гантелями на гимнастическом мяче

source: potty squat with support
ru: приседание с опорой на горшок

source: raise single arm push-up
ru: отжимание на одной руке

source: dumbbell over bench one arm reverse wrist curl
ru: разгибание одной руки с гантелями над скамьей

source: cable pulldown (pro lat bar)
ru: тросовые тяги (штанга для лат)

source: single leg bridge with outstretched leg
ru: мостик на одной ноге с вытянутой ногой

source: cable seated row
ru: кабельный сидячий ряд

source: smith hack squat
ru: приседание со штангой Смита

source: jack burpee
ru: джек-бурпе

source: cable triceps pushdown (v-bar) (with arm blaster)
ru: Кабельный жим на трицепс (V-образная штанга) (с армбластером)

source: kettlebell double jerk
ru: двойной рывок гири

source: barbell narrow stance squat
ru: приседание со штангой в узкой стойке

source: 45° side bend
ru: боковой сгиб на 45°

source: barbell seated bradford rocky press
ru: жим штанги сидя с брэдфордскими скалками

source: lever incline chest press v. 2
ru: Наклонный жим от груди с рычагом v. 2

source: dumbbell seated inner biceps curl
ru: разгибание гантелей на внутренние бицепсы

source: barbell standing wide grip biceps curl
ru: разгибание на бицепс с широким хватом в стойке со штангой

source: barbell glute bridge
ru: Ягодичный мостик со штангой

source: squat jerk
ru: рывок с приседанием

source: dumbbell standing bent over two arm triceps extension
ru: разгибание гантелей стоя с наклоном на две руки на трицепс

source: dumbbell w-press
ru: жим гантелей

source: dumbbell alternate biceps curl (with arm blaster)
ru: попеременное разгибание гантелей на бицепс (с армбластером)

source: lever seated good morning
ru: рычаг сидя доброе утро

source: barbell biceps curl (with arm blaster)
ru: Разгибание штанги на бицепс (с армбластером)

source: band assisted wheel rollerout
ru: разводка колес с помощью ленты

source: mountain climber
ru: альпинист

source: dumbbell hammer curl v. 2
ru: Скручивание гантели с молотком v. 2

source: barbell zercher squat
ru: приседание со штангой

source: lever donkey calf raise
ru: рычажный подъем икроножных

source: lever seated hip adduction
ru: разгибание бедра с помощью рычага

source: cable assisted inverse leg curl
ru: обратное разгибание ног с помощью троса

source: seated piriformis stretch
ru: растяжка пирифиса в положении сидя

source: exercise ball lat stretch
ru: разгибание ног на мяче

source: cable lat pulldown full range of motion
ru: разгибание на тросе с полной амплитудой движения

source: ez-barbell standing wide grip biceps curl
ru: разгибание бицепса с помощью гантели ez-barbell стоя широким хватом

source: suspended split squat
ru: приседания с отягощением

source: back and forth step
ru: шаг вперёд-назад

source: weighted decline sit-up
ru: приседания с отягощением

source: hanging leg hip raise
ru: подъем бедра с висячей ногой

source: weighted three bench dips
ru: три наклона к скамье с отягощением

source: assisted seated pectoralis major stretch with stability ball
ru: растяжка грудных мышц в положении сидя с помощью мяча для стабилизации

source: dumbbell lying one arm pronated triceps extension
ru: разгибание трицепса с гантелями лежа на одной руке

source: dumbbell one arm reverse grip press
ru: жим гантелей одной рукой обратным хватом

source: arms overhead full sit-up (male)
ru: полный присед на руках над головой (мужчины)

source: seated wide angle pose sequence
ru: последовательность широкоугольных поз в положении сидя

source: dumbbell push press
ru: жим гантелей

source: cable rope crossover seated row
ru: перекрещивание тросов в приседе

source: band one arm twisting seated row
ru: Скручивания с лентой на одной руке в приседе

source: cable standing hip extension
ru: разгибание бедра на тросе

source: smith single leg split squat
ru: приседание на одной ноге со сплитом Смита

source: captains chair straight leg raise
ru: Подъем прямых ног на стуле капитана

source: kettlebell pirate supper legs
ru: гиревой тренажер пиратские ноги

source: barbell rear delt raise
ru: Подъем задних дельт со штангой

source: l-pull-up
ru: подтягивания

source: dumbbell romanian deadlift
ru: подъем гантелей с румынским мертвым хватом

source: barbell skier
ru: лыжник со штангой

source: dumbbell seated triceps extension
ru: разгибание на трицепс с гантелями в приседе

source: dumbbell standing triceps extension
ru: разгибание гантелей на трицепс стоя

source: suspended abdominal fallout
ru: выпады на живот в подвешенном состоянии

source: crab twist toe touch
ru: Скручивание краба с касанием пальцев ног

source: band lying hip internal rotation
ru: Внутреннее вращение бедра с лентой в положении лежа

source: weighted hyperextension (on stability ball)
ru: гиперэкстензия с отягощением (на мяче для стабильности)

source: band close-grip push-up
ru: отжимание на брусьях с близким хватом

source: barbell deadlift
ru: подъём штанги

source: dumbbell biceps curl
ru: разгибание гантелей на бицепс

source: dumbbell decline fly
ru: махи гантелей вниз

source: plyo push up
ru: отжимание на брусьях

source: dumbbell incline one arm hammer press
ru: Наклонный жим гантелей одной рукой

source: bodyweight side lying biceps curl
ru: разгибание бицепса лежа с боковым весом

source: reverse crunch
ru: обратный кранч

source: medicine ball chest push multiple response
ru: Жим от груди с медицинским мячом в несколько подходов

source: cable forward raise
ru: подъем на тросе вперед

source: smith bent knee good morning
ru: Доброе утро, Смит

source: ez bar seated close grip concentration curl
ru: концентрическое скручивание на перекладине

source: cable one arm incline press
ru: кабельный жим одной рукой в наклоне

source: full planche
ru: полный планш

source: dumbbell iron cross
ru: железный крест с гантелями

source: incline leg hip raise (leg straight)
ru: Наклонный подъем бедра (нога прямая)

source: barbell bench squat
ru: приседание со штангой

source: band vertical pallof press
ru: вертикальный жим с лентой

source: dumbbell one arm bent-over row
ru: гантельный ряд на одной руке

source: potty squat
ru: приседание с горшком

source: quick feet v. 2
ru: быстрые ноги v. 2

source: dumbbell over bench one arm neutral wrist curl
ru: Скручивание гантели над скамьей на одну руку с нейтральным запястьем

source: cable pulldown
ru: кабельный пулдаун

source: band single leg split squat
ru: приседание на одной ноге с лентой

source: band side triceps extension
ru: боковое разгибание трицепса с лентой

source: single arm push-up
ru: отжимание на одной руке

source: cable seated rear lateral raise
ru: боковой подъем на тросе в положении сидя

source: isometric wipers
ru: изометрические сбрасыватели

source: cable triceps pushdown (v-bar)
ru: отжимание на трицепс на тросе (v-bar)

source: kettlebell double alternating hang clean
ru: гиревой двойной попеременный жим

source: barbell lying triceps extension skull crusher
ru: Разгибание штанги на трицепс лежа

source: barbell seated behind head military press
ru: жим штанги сидя за головой

source: lever incline chest press
ru: жим от груди с наклоном

source: dumbbell seated hammer curl
ru: Скручивание гантелей в приседе

source: barbell standing twist
ru: скручивания со штангой стоя

source: sphinx
ru: сфинкс

source: dumbbell standing bent over one arm triceps extension
ru: Разгибание трицепса с гантелями на одной руке

source: dumbbell waiter biceps curl
ru: Разгибание бицепса с гантелями

source: dumbbell alternate biceps curl
ru: попеременное разгибание гантелей на бицепс

source: lever seated fly
ru: махи сидя с рычагом

source: monster walk
ru: ходьба монстра

source: dumbbell hammer curl on exercise ball
ru: Скручивание гантелей на мяче для упражнений

source: barbell wrist curl v. 2
ru: Скручивание запястий со штангой v. 2

source: lever decline chest press
ru: рычажный жим от груди

source: cable alternate triceps extension
ru: попеременное разгибание трицепса на тросе

source: seated lower back stretch
ru: растяжка нижнечивания со штангой стоя

source: exercise ball hug
ru: обнимание мяча для упражнений

source: cable kneeling triceps extension
ru: разгибание коленей на трицепс

source: ez-bar close-grip bench press
ru: жим штанги лежа с близким хватом

source: stationary bike run v. 3
ru: бег на стационарном велосипеде v. 3

source: weighted crunch
ru: кранч с отягощением

source: handstand push-up
ru: отжимание в стойке на руках

source: weighted svend press
ru: жим штанги лежа с отягощением

source: dumbbell lying one arm press v. 2
ru: жим гантелей лежа на одной руке v. 2

source: dumbbell one arm reverse fly (with support)
ru: обратный мах гантелей на одну руку (с поддержкой)

source: scapula push-up
ru: отжимание на лопатках

source: dumbbell pullover on exercise ball
ru: пуловер с чивания со штангой стоя

source: cable reverse-grip straight back seated high row
ru: Кабельный обратный хват с прямой спиной в приседе

source: band pull through
ru: тяга ленты через себя

source: sled one leg calf press on leg press
ru: жим икроножных на одной ноге на санках

source: cable standing fly
ru: махи стоя на тросе

source: smith shrug
ru: плечи Смита

source: cambered bar lying row
ru: разгибание штанги лежа

source: kettlebell one arm snatch
ru: рывок гири на одной руке

source: barbell rack pull
ru: тяга штанги к стойке

source: korean dips
ru: корейские дипы

source: dumbbell reverse wrist curl
ru: обратное разгибание рук с гантелями

source: barbell sitted alternate leg raise (female)
ru: Подъем ног со штангой в приседе (женщины)

source: dumbbell seated shoulder press (parallel grip)
ru: жим чивания со штангой стоя

source: barbell front raise and pullover
ru: Подъем штанги вперед и пуловер

source: superman push-up
ru: отжимание супермена

source: dumbbell standing reverse curl
ru: обратные разгибания гантели стоя

source: cocoons
ru: коконы

source: weighted bench dip
ru: разводка на скамье с отягощением

source: band jack knife sit-up
ru: приседание с ленточным ножом

source: dumbbell bicep curl with stork stance
ru: Разгибание гантелей на бицепс в стойке аиста

source: band concentration curl
ru: концентрическое скручивание с лентой

source: dumbbell decline bench press
ru: жим лежа с гантелями

source: lever seated calf press
ru: Рычажный жим сидя

source: band alternating biceps curl
ru: попеременное разгибание на бицепс

source: pike-to-cobra push-up
ru: отжимание от груди до кобры

source: dumbbell incline one arm fly on exercise ball
ru: махи одной рукой с гантелями в наклоне на гимнастическом мяче

source: bodyweight kneeling triceps extension
ru: разгибание трицепса на коленях с весом тела

source: resistance band seated straight back row
ru: разводка с резистивной лентой в приседе с прямой спиной

source: lying elbow to knee
ru: жим лежа от локтя до колена

source: cable floor seated wide-grip row
ru: разводка на тросах на полу с широким хватом

source: smith bench press
ru: жим лежа

source: ez bar reverse grip bent over row
ru: разводка на перекладине обратным хватом

source: cable one arm incline fly on exercise ball
ru: Наклонный мах одной рукой на гимнастическом мяче

source: full maltese
ru: полный мальтезе

source: dumbbell incline y-raise
ru: наклонный Y-образный подъем гантелей

source: incline close-grip push-up
ru: отжимание на наклонной скамье с близким хватом

source: band wrist curl
ru: разгибание запястья

source: dumbbell one arm bench fly
ru: махи гантелей на скамье для жима одной рукой

source: posterior tibialis stretch
ru: Растяжка задней поверхности голени

source: band step-up
ru: подтягивание на перекладине

source: quarter sit-up
ru: четверть приседания

source: dumbbell over bench neutral wrist curl
ru: Разгибание запястья с гантелями над скамьей

source: cable pull through (with rope)
ru: подтягивание на тросе (с веревкой)

source: side-to-side toe touch (male)
ru: боковое касание пальцев ног (мужчины)

source: cable seated overhead curl
ru: разгибание рук в приседе на тросе

source: isometric chest squeeze
ru: изометрическое сжатие грудной клетки

source: cable thibaudeau kayak row
ru: тросовый гребок на байдарке тибодо

source: kettlebell bottoms up clean from the hang position
ru: гиревой жим снизу вверх из положения виса

source: barbell lying triceps extension
ru: разгибание на трицепс лежа со штангой

source: barbell romanian deadlift
ru: римский мертвый подъем со штангой

source: lever horizontal one leg press
ru: горизонтальный жим одной ногой

source: dumbbell seated front raise
ru: подъем гантелей в приседе

source: barbell standing rocking leg calf raise
ru: подъем икроножной мышцы со штангой стоя

source: barbell glute bridge two legs on bench (male)
ru: Ягодичный мостик со штангой на двух ногах на скамье (мужчина)

source: spell caster
ru: заклинатель

source: dumbbell standing around world
ru: гантель стоя вокруг света

source: dumbbell upright shoulder external rotation
ru: внешнее вращение плеч с гантелью в вертикальном положении

source: drop push up
ru: отжимание от пола

source: lever seated dip
ru: рычаг сидя

source: modified push up to lower arms
ru: модифицированный жим вверх для опускания рук

source: dumbbell hammer curl
ru: разгибание гантели

source: lever deadlift
ru: рычажный мертвый подъем

source: cable alternate shoulder press
ru: попеременный жим на тросе

source: seated leg raise
ru: подъем ног в приседе

source: exercise ball hip flexor stretch
ru: Растяжка сгибателей бедра на мяче

source: cable kneeling rear delt row (with rope) (male)
ru: разводка задних дельт на коленях (с веревкой) (мужчины)

source: ez-bar biceps curl (with arm blaster)
ru: разгибание бицепса на перекладине (с армбластером)

source: star jump (male)
ru: прыжки со звездой (мужчины)

source: weighted cossack squats (male)
ru: приседания с отягощением (мужчины)

source: handstand
ru: стойка на руках

source: weighted stretch lunge
ru: выпад с отягощением

source: assisted side lying adductor stretch
ru: растяжка аддукторов лежа на боку

source: dumbbell lying one arm press
ru: жим гантелей лежа на одной руке

source: assisted parallel close grip pull-up
ru: подтягивания параллельным хватом

source: dumbbell one arm reverse wrist curl
ru: обратное разгибание запястья с гантелью на одной руке

source: scapula dips
ru: наклоны к лопаткам

source: band squat
ru: приседание с лентой

source: dumbbell pullover hip extension on exercise ball
ru: Разгибание бедер с гантелями на гимнастическом мяче

source: cable reverse-grip pushdown
ru: отжимание на тросе обратным хватом

source: band push sit-up
ru: приседание с лентой

source: sled lying squat
ru: приседание на санках лежа

source: cable standing crunch (with rope attachment)
ru: Хруст на тросе стоя (с креплением на веревке)

source: smith shoulder press
ru: жим смита на плечи

source: calf stretch with rope
ru: растяжка икроножных с веревкой

source: kettlebell one arm row
ru: гиревой ряд на одной руке

source: barbell pullover to press
ru: разводка штанги на пресс

source: kneeling push-up (male)
ru: отжимание на коленях (мужчина)

source: arm slingers hanging straight legs
ru: разгибание рук с прямыми ногами

source: dumbbell reverse spider curl
ru: обратные паучьи скручивания с гантелями

source: barbell sitted alternate leg raise
ru: попеременный подъем ног со штангой в приседе

source: dumbbell seated shoulder press
ru: жим гантелей сидя на плечах

source: barbell wrist curl
ru: разгибание рук со штангой

source: straight leg outer hip abductor
ru: Внешний абдуктор бедра на прямых ногах

source: dumbbell standing preacher curl
ru: разгибание гантелей стоя

source: close-grip push-up (on knees)
ru: отжимание с близкого хвата (на коленях)

source: v-sit on floor
ru: v-sit на полу

source: barbell decline bench press
ru: жим штанги лежа

source: dumbbell bicep curl on exercise ball with leg raised
ru: Разгибание гантелей на бицепс на мяче для упражнений с поднятой ногой

source: dumbbell deadlift
ru: подъём гантелей

source: lever rotary calf
ru: поворотный рычаг для икры

source: peroneals stretch
ru: растяжка малоберцовых костей

source: dumbbell incline one arm fly
ru: махи одной рукой с наклоном гантели

source: bodyweight incline side plank
ru: наклонная боковая планка с весом тела

source: resistance band seated shoulder press
ru: Жим от плеч с резистивной лентой

source: lying (side) quads stretch
ru: растяжка квадрицепсов лежа (на боку)

source: cable drag curl
ru: кабельное скручивание

source: smith behind neck press
ru: жим смита за шею

source: ez bar lying close grip triceps extension behind head
ru: разгибание трицепса за головой в упоре лежа

source: cable one arm fly on exercise ball
ru: Кабельняче для упражнений с поднятой ногой

source: back extension on exercise ball
ru: разгибание спины на гимнастическом мяче

source: front plank with twist
ru: передняя планка с поворотом

source: dumbbell incline two arm extension
ru: разгибание гантелей в наклоне на две руки

source: inchworm v. 2
ru: дюймовый червь v. 2

source: dumbbell neutral grip bench press
ru: жим гантелей нейтральным хватом

source: posterior step to overhead reach
ru: Подтягивание с задней ступеньки на верхнюю

source: dumbbell one leg fly on exercise ball
ru: махи гантелями на одной ноге на гимнастическом мяче

source: assisted lying gluteus and piriformis stretch
ru: растяжка ягодиц и пириформиса в положении лежа

source: quads
ru: квадрицепсы

source: cable press on exercise ball
ru: жим с троса на мяче

source: assisted chest dip (kneeling)
ru: разведение рук в стороны (стоя на коленях)

source: side-to-side chin
ru: подбородок из стороны в сторону

source: cable seated one arm concentration curl
ru: концентрическое скручивание на одной руке в положении сидя на тросе

source: iron cross stretch
ru: растяжка железного креста

source: cable supine reverse fly
ru: обратные махи с троса на спину

source: kettlebell bent press
ru: гиревой жим

source: barbell lying preacher curl
ru: разгибание штанги лежа

source: barbell rollerout from bench
ru: разгибание штанги со скамьи

source: lever gripper hands
ru: рычажный захват рук

source: dumbbell seated curl
ru: разгибание гантели сидя

source: barbell standing reverse grip curl
ru: Скручивание гантели стоя обратным хватом

source: smith toe raise
ru: подъем на носки смита

source: dumbbell standing alternating tricep kickback
ru: разводка гантелей на трицепс попеременно

source: dumbbell upright row (back pov)
ru: Подъем гантелей в вертикальном положении (спиной вперед)

source: donkey calf raise
ru: подъем икроножных

source: band fixed back close grip pulldown
ru: Подтягивания с фиксированной спиной закрытым хватом

source: barbell clean and press
ru: жим штанги лежа

source: medicine ball chest push from 3 point stance
ru: Жим от груди с медицинским мячом из трехпозиционной стойки

source: dumbbell goblet squat
ru: приседание с гантелями

source: lever chest press
ru: жим от груди с рычагом

source: butterfly yoga pose
ru: Поза бабочки в йоге

source: seated glute stretch
ru: растяжка ягодиц в положении сидя

source: exercise ball dip
ru: упражнения с мячом

source: cable kneeling crunch
ru: кабельный кранч на колени

source: ez barbell spider curl
ru: паучьи скручивания со штангой

source: standing wheel rollerout
ru: стоячий ролик

source: weighted close grip chin-up on dip cage
ru: подтягивания на дип-клетке с отягощением для закрытого хвата

source: hands reversed clasped circular toe touch (male)
ru: круговое касание пальцев ног руками (мужчины)

source: weighted straight bar dip
ru: разводка на прямой штанге с отягощением

source: dumbbell lying one arm deltoid rear
ru: жим гантелей лежа на одной руке, дельтовидные мышцы сзади

source: band y-raise
ru: подтягивания на перекладине

source: dumbbell one arm pullover on exercise ball
ru: разводка гантелей на одной руке на гимнастическом мяче

source: russian twist
ru: русский твист

source: dumbbell pullover
ru: пуловер с гантелями

source: cable reverse wrist curl
ru: обратное разгибание запястья на тросе

source: sled lying calf press
ru: жим икроножных лежа на санках

source: cable standing crunch
ru: кабельный кранч стоя

source: smith seated wrist curl
ru: разгибание запястий в сидячем положении

source: calf stretch with hands against wall
ru: Растяжка икроножных с опорой руками о стену

source: kettlebell one arm push press
ru: жим гири одной рукой

source: 3/4 sit-up
ru: присед на 3/4

source: barbell pullover
ru: пуловер со штангой

source: kneeling plank tap shoulder (male)
ru: Планка на коленях с касанием плеча (мужчина)

source: arm slingers hanging bent knee legs
ru: Подтягивания на руках, вися на согнутых в коленях ногах

source: dumbbell reverse preacher curl
ru: обратное скручивание гантелей

source: barbell single leg split squat
ru: приседания со штангой на одной ноге

source: lever seated crunch v. 2
ru: рычажный кранч с приседом v. 2

source: dumbbell seated reverse grip one arm overhead tricep extension
ru: разводка гантелей с обратным хватом на одну руку с верхним трицепсом

source: barbell wide-grip upright row
ru: подтягивания на перекладине с широким хватом

source: straddle planche
ru: планкетка

source: dumbbell standing palms in press
ru: жим гантелей стоя ладонями внутрь

source: close-grip push-up
ru: отжимание с близкого хвата

source: upward facing dog
ru: собака, обращенная вверх

source: wrist rollerer
ru: роллер для запястий

source: dumbbell bicep curl lunge with bowling motion
ru: Выпад с гантелями на бицепс с движением боулинга

source: dumbbell cuban press v. 2
ru: жим гантелей кубань v. 2

source: knee touch crunch
ru: кранч с касанием колена

source: pelvic tilt into bridge
ru: наклон таза в мостик

source: lever reverse grip lateral pulldown
ru: боковое разгибание рычага обратным хватом

source: dumbbell incline inner biceps curl
ru: разгибание гантелей на внутренние бицепсы

source: bodyweight drop jump squat
ru: приседание с падением веса тела

source: resistance band seated hip abduction
ru: абдукция бедра в положении сидя с лентой сопротивления

source: lunge with twist
ru: выпад с поворотом

source: cable decline seated wide-grip row
ru: Кабельное сокращение сидячего ряда с широким хватом

source: smith back shrug
ru: плечи Смита

source: ez bar lying bent arms pullover
ru: пуловер на согнутых руках

source: cable one arm decline chest fly
ru: Кабельные махи на грудь с одной рукой

source: front lever reps
ru: повторы с передним рычагом

source: assisted standing triceps extension (with towel)
ru: разгибание трицепса стоя (с полотенцем)

source: dumbbell incline twisted flyes
ru: Скрученные махи с гантелями в наклоне

source: inchworm
ru: дюймовый червь

source: dumbbell lying wide curl
ru: широкие разгибания гантелей лежа

source: pelvic tilt
ru: наклон таза
