Repository: kostya-lee003/Rockout
Catalog: Rockout/Supporting Files/*.lproj/LocalizableExercises.strings
Languages: ru

source: band stiff leg deadlift
ru: подтягивания на жестких ногах с лентой

source: push-up plus
ru: отжимание плюс

source: dumbbell one arm zottman preacher curl
ru: Скручивание гантелей на одну руку с проповедником Зоттмана

source: cable preacher curl
ru: кабельное скручивание

source: band squat row
ru: приседания с лентой

source: side push neck stretch
ru: растяжка шеи боковым толчком

source: cable seated one arm alternate row
ru: кабельный присед на одной руке

source: band reverse fly
ru: обратная мушка с лентой

source: inverted row with straps
ru: перевернутый ряд с лямками

source: cable straight back seated row
ru: Кабельный присед с прямой спиной

source: kettlebell arnold press
ru: жим гири Арнольда

source: barbell lying lifting (on hip)
ru: Подъем штанги лежа (на бедро)

source: barbell rollerout
ru: разводка штанги

source: lever gripless shrug v. 2
ru: безрычажные плечи v. 2

source: dumbbell seated calf raise
ru: подъем икры с гантелями

source: barbell standing overhead triceps extension
ru: разгибание трицепса со штангой стоя

source: smith sumo squat
ru: приседание сумо смита

source: dumbbell standing alternate raise
ru: попеременный подъем гантелей стоя

source: dumbbell upright row
ru: вертикальный ряд с гантелями

source: diamond push-up
ru: бриллиантовое отжимание

source: band fixed back underhand pulldown
ru: Подтягивания с фиксированной спиной на ленте

source: medicine ball chest pass
ru: проход с мячом для медицины на груди

source: dumbbell full can lateral raise
ru: боковой подъем гантели

source: butt-ups
ru: подъемы на ягодицы

source: seated calf stretch (male)
ru: растяжка икроножных мышц в положении сидя (мужчины)

source: exercise ball back extension with rotation
ru: Разгибание спины с вращением на мяче

source: cable kickback
ru: тросовый откат

source: standing pelvic tilt
ru: наклон таза стоя

source: walking on stepmill
ru: ходьба на степмиле

source: hands clasped circular toe touch (male)
ru: сцепленные руки, круговое касание пальцами ног (мужчины)

source: weighted standing hand squeeze
ru: выжимание рук с отягощением стоя

source: dumbbell lying on floor rear delt raise
ru: Подъем задних дельт с гантелями лежа на полу

source: assisted prone hamstring
ru: подколенное сухожилие

source: dumbbell one arm prone hammer curl
ru: разгибание гантели одной рукой в упоре молот

source: runners stretch
ru: растяжка я (мужчины)

source: dumbbell prone incline hammer curl
ru: разгибание гантели в наклоне

source: cable reverse preacher curl
ru: обратное разгибание на тросе

source: sled hack squat
ru: приседание на санках

source: cable standing cross-over high reverse fly
ru: Кабельные обратные махи стоя

source: smith seated shoulder press
ru: жим смита сидя на плечах

source: calf push stretch with hands against wall
ru: Растяжка икроножных мышц с опорой руками о стену

source: kettlebell one arm military press to the side
ru: Гиревой жим одной рукой в сторону

source: barbell prone incline curl
ru: наклонное скручивание со штангой

source: kipping muscle up
ru: подтягивание на руках

source: dumbbell reverse grip row (female)
ru: разводка гантелей обратным хватом (женщина)

source: archer push up
ru: отжимание из лука

source: barbell single leg deadlift
ru: Подъем штанги на одну ногу

source: lever seated crunch (chest pad)
ru: Рычажный кранч в приседе (с грудной клеткой)

source: dumbbell seated revers grip concentration curl
ru: концентрическое скручивание гантелей сидя обратным хватом

source: barbell wide squat
ru: широкие приседания со штангой

source: barbell front squat
ru: фронтальное приседание со штангой

source: straddle maltese
ru: мальтийский шпагат

source: dumbbell standing overhead press
ru: жим гантелей стоя над головой

source: close grip chin-up
ru: подтягивание за руки

source: upper back stretch
ru: растяжка верхней части спины

source: wrist circles
ru: круги на запястьях

source: dumbbell bent over row
ru: разводка гантелей в наклоне

source: dumbbell cuban press
ru: жим гантелей кубань

source: outside leg kick push-up
ru: Отжимание с отталкиванием внешней ногой

source: lever pullover
ru: рычажный пуловер

source: dumbbell incline hammer press on exercise ball
ru: Наклонный жим гантелей на гимнастическом мяче

source: body-up
ru: боди-ап

source: resistance band seated chest press
ru: Жим от груди на резинке

source: london bridge
ru: лондонский мост

source: cable decline press
ru: кабельный жим

source: sledge hammer
ru: кувалда

source: ez bar french press on exercise ball
ru: Французский жим на мяче

source: cable one arm curl
ru: тросовые одноручные скручивания

source: front lever
ru: передний рычаг

source: dumbbell incline triceps extension
ru: разгибание гантелей на трицепс

source: impossible dips
ru: невозможные наклоны

source: dumbbell lying triceps extension
ru: разгибание трицепса с гантелями лежа

source: overhead triceps stretch
ru: разгибание на трицепс сверху

source: push-up on lower arms
ru: отжимание на нижних руках

source: assisted hanging knee raise
ru: подтягивание на коленях

source: dumbbell one arm wrist curl
ru: разгибание запястья с гантелями на одной руке

source: side plank hip adduction
ru: разведение бедер на боковой планке

source: cable seated high row (v-bar)
ru: разводка сидя на тросе (v-bar)

source: inverted row v. 2
ru: перевернутый ряд v. 2

source: cable straight arm pulldown (with rope)
ru: подтягивание на тросе на прямых руках (с веревкой)

source: kettlebell alternating row
ru: чередование гиревого ряда

source: barbell lying extension
ru: разгибание штанги лежа

source: barbell reverse wrist curl
ru: обратное разгибание рук со штангой

source: lever gripless shrug
ru: разгибание плеч без рычага

source: dumbbell seated biceps curl to shoulder press
ru: разгибание гантелей на бицепс и жим от плеч

source: barbell standing leg calf raise
ru: Подъем икроножных ног со штангой

source: barbell good morning
ru: штанга доброе утро

source: smith standing military press
ru: жим штанги стоя

source: dumbbell standing alternate overhead press
ru: попеременный жим гантелей стоя

source: barbell decline pullover
ru: разводка со штангой

source: dumbbell twisting bench press
ru: жим гантелей на скамье с поворотом

source: deep push up
ru: глубокий жим

source: barbell clean-grip front squat
ru: Приседание со штангой чистым хватом

source: medicine ball catch and overhead throw
ru: ловля и бросок мяча с медикаментами через голову

source: dumbbell front raise v. 2
ru: Подъем гантели вперед v. 2

source: lever calf press
ru: икроножный жим

source: burpee
ru: бурпи

source: scissor jumps (male)
ru: прыжки ножницами (мужчины)

source: otis up
ru: отис вверх

source: exercise ball back extension with knees off ground
ru: разгибание спины на мяче с отрывом коленей от земли

source: cable judo flip
ru: сальто дзюдо на тросе

source: ez barbell seated triceps extension
ru: разгибание трицепса со штангой

source: standing lateral stretch
ru: боковая растяжка стоя

source: cable palm rotational row
ru: кабельный вращательный ряд

source: walking on incline treadmill
ru: ходьба по наклонной беговой дорожке

source: hands bike
ru: ручной велосипед

source: weighted seated twist (on stability ball)
ru: Скручивания в приседе с отягощением (на мяче для стабильности)

source: dumbbell lying hammer press
ru: жим гантелей лежа

source: barbell alternate biceps curl
ru: Попеременное разгибание бицепса со штангой

source: dumbbell one arm prone curl
ru: Скручивание гантелей на одной руке

source: roller seated single leg shoulder flexor depresor retractor
ru: разгибание плеч на одной ноге с роликом

source: dumbbell prone incline curl
ru: наклонное скручивание с гантелями

source: cable reverse one arm curl
ru: кабельные обратные одноручные скручивания

source: sled forward angled calf raise
ru: подъем икры на санках под прямым углом

source: cable standing calf raise
ru: кабельные подъемы на икры стоя

source: smith seated one leg calf raise
ru: подъем икроножной мышцы на одну ногу с сидячим тренажером Смита

source: cable wrist curl
ru: кабельное скручивание запястья

source: kettlebell one arm jerk
ru: рывок гири на одну руку

source: barbell press sit-up
ru: жим штанги лежа

source: kick out sit
ru: присед с выбиванием

source: dumbbell reverse grip incline bench two arm row
ru: Наклонная скамья с гантелями обратным хватом двухручный ряд

source: archer pull up
ru: подтягивания из лука

source: barbell side split squat v. 2
ru: приседания со штангой в стороны v. 2

source: lever seated crunch
ru: рычажный присед

source: dumbbell seated preacher curl
ru: присед с гантелями

source: barbell wide reverse grip bench press
ru: жим штанги лежа широким обратным хватом

source: barbell full squat
ru: полное приседание со штангой

source: stationary bike walk
ru: прогулка на стационарном велосипеде

source: dumbbell standing one arm reverse curl
ru: Скручивания гантелей стоя на одной руке

source: clock push-up
ru: отжимание с часами

source: two toe touch (male)
ru: касание двумя пальцами ног (мужчины)

source: world greatest stretch
ru: величайшая в мире растяжка

source: dumbbell bench squat
ru: приседание со скамьей для гантелей

source: band bench press
ru: жим лежа с лентой

source: dumbbell cross body hammer curl v. 2
ru: Скручивание гантелей в поперечном направлении v. 2

source: one leg donkey calf raise
ru: подъем икры на одну ногу

source: lever preacher curl v. 2
ru: разгибание рычага для проповедника v. 2

source: dumbbell incline hammer press
ru: жим гантелей в наклоне

source: biceps pull-up
ru: подтягивание на бицепс

source: resistance band seated biceps curl
ru: разгибание бицепса на резиновую ленту

source: lever unilateral row
ru: односторонний рычажный ряд

source: cable decline one arm press
ru: жим одной руки на тросе

source: sled closer hack squat
ru: приседания на санках

source: exercise ball supine triceps extension
ru: Разгибание трицепса на мяче

source: cable one arm bent over row
ru: разгибание на одной руке

source: frog planche
ru: лягушачий ланч

source: assisted triceps dip (kneeling)
ru: разводка на трицепс (стоя на коленях)

source: dumbbell incline t-raise
ru: наклонные подъемы гантелей

source: hyperextension (on bench)
ru: гиперэкстензия (на скамье)

source: dumbbell lying supine curl
ru: разгибание гантелей лежа на спине

source: push-up medicine ball
ru: отжимание на медицинском мяче

source: band straight back stiff leg deadlift
ru: подтягивания на прямых ногах с лентой

source: dumbbell one arm upright row
ru: разводка гантелей на одной руке в вертикальном положении

source: side lying hip adduction (male)
ru: боковая аддукция бедра лежа (мужчины)

source: barbell incline reverse-grip press
ru: Наклонный жим штанги обратным хватом

source: cable seated curl
ru: кабельное сидячее скручивание

source: inverted row on bench
ru: перевернутый ряд на скамье

source: cable straight arm pulldown
ru: подтягивания на тросе с прямыми руками

source: kettlebell alternating renegade row
ru: попеременные гиревые разводки

source: barbell lying close-grip triceps extension
ru: Разгибание трицепса штанги лежа с близким хватом

source: barbell reverse preacher curl
ru: обратное разгибание штанги

source: lever front pulldown
ru: рычажный фронтальный пулдаун

source: dumbbell seated biceps curl (on stability ball)
ru: разгибание гантелей на бицепс (на мяче для стабильности)

source: barbell standing front raise over head
ru: Подъем штанги над головой

source: smith one leg floor calf raise
ru: подъем икроножных на одну ногу

source: dumbbell standing alternate hammer curl and press
ru: Скручивание и жим гантелей стоя в чередовании с молотком

source: dumbbell tricep kickback with stork stance
ru: Выпады на трицепс с гантелями в стойке аиста

source: decline sit-up
ru: приседание со снижением

source: march sit (wall)
ru: марш-присед (у стены)

source: dumbbell front raise
ru: подъём гантелей вперёд

source: band alternating v-up
ru: попеременные подъемы с лентой

source: lever alternate leg press
ru: попеременный жим ногами

source: bridge - mountain climber (cross body)
ru: мост - альпинист (поперек тела)

source: scapular pull-up
ru: подтягивание лопаток

source: one leg squat
ru: приседание на одной ноге

source: exercise ball back extension with hands behind head
ru: Разгибание спины на мяче с руками за головой

source: cable incline triceps extension
ru: разгибание трицепса на тросе

source: ez barbell seated curls
ru: сидячие скручивания со штангой

source: standing hamstring and calf stretch with strap
ru: растяжка подколенных и икроножных сухожилий с помощью ремня

source: cable overhead triceps extension (rope attachment)
ru: разгибание на трицепс на тросе (с креплением на веревку)

source: walking lunge
ru: ходячий выпад

source: hamstring stretch
ru: растяжка подколенных сухожилий

source: weighted seated bicep curl (on stability ball)
ru: разгибание бицепса с отягощением (на мяче для стабильности)

source: dumbbell lying femoral
ru: жим гантелей лежа на бедре

source: dumbbell one arm press on exercise ball
ru: жим гантелей одной рукой на гимнастическом мяче

source: roller seated shoulder flexor depresor retractor
ru: разгибание плечевого сгибателя на роликах в положении сидя

source: dumbbell pronate-grip triceps extension
ru: разгибание гантелей на трицепс пронационным хватом

source: cable reverse grip triceps pushdown (sz-bar) (with arm blaster)
ru: жим на трицепс обратным на трицепс на тросе (с креплением на веревку)

source: sled calf press on leg press
ru: жим икроножных на санках на пресс для ног

source: cable standing back wrist curl
ru: разгибание запястий стоя на тросе

source: smith reverse-grip press
ru: жим смита обратным хватом

source: cable wide grip rear pulldown behind neck
ru: разгибание гири за шею широким хватом

source: kettlebell one arm floor press
ru: жим гири от пола на одну руку

source: barbell preacher curl
ru: разгибание штанги

source: kettlebell windmill
ru: гиревая мельница

source: dumbbell reverse grip incline bench one arm row
ru: разводка гантелей с обратным хватом на наклонной скамье на одной руке

source: ankle circles
ru: круги на лодыжках

source: barbell side split squat
ru: приседания со штангой

source: lever seated calf raise
ru: подъем икроножных с рычагом

source: dumbbell seated palms up wrist curl
ru: Скручивание запястий с гантелями на ладони вверх

source: barbell wide bench press
ru: жим штанги лежа на широкой скамье

source: standing single leg curl
ru: разгибание одной ноги стоя

source: dumbbell standing one arm palm in press
ru: жим гантелей стоя на одной руке

source: clap push up
ru: отжимание с хлопком

source: twisted leg raise (female)
ru: подъем ног с поворотом (женщина)

source: weighted triceps dip on high parallel bars
ru: разводка на трицепс с отягощением на высоких параллельных брусьях

source: dumbbell bench seated press
ru: жим гантелей сидя на скамье

source: dumbbell cross body hammer curl
ru: Скручивание гантелей в поперечном направлении

source: one arm towel row
ru: гребля на полотенце одной рукой

source: lever preacher curl
ru: разгибание рычага

source: dumbbell incline hammer curl
ru: наклонное разгибание гантелей

source: biceps narrow pull-ups
ru: узкие подтягивания на бицепс

source: resistance band leg extension
ru: разгибание ног с лентой сопротивления

source: lever triceps extension
ru: разгибание на трицепс с рычагом

source: cable decline fly
ru: кабельные махи вниз

source: sled 45в° leg wide press
ru: жим ногами на санках под углом 45в°

source: smith machine reverse decline close grip bench press
ru: жим лежа на скамье смита с обратным снижением

source: exercise ball seated triceps stretch
ru: Разгибание трицепса на мяче

source: cable middle fly
ru: кабельные средние махи

source: frog crunch
ru: лягушачий хруст

source: dumbbell incline shrug
ru: жим гантелей в наклоне

source: hyperextension
ru: гиперэкстензия

source: dumbbell lying supine biceps curl
ru: разгибание бицепса с гантелями лежа на спине

source: push-up inside leg kick
ru: отжимание с внутренней стороны ноги

source: dumbbell one arm triceps extension (on bench)
ru: разгибание трицепса с гантелями на одной руке (на скамье)

source: side lying floor stretch
ru: боковая растяжка лежа на полу

source: cable seated crunch
ru: кабельный сидячий кранч

source: inverted row bent knees
ru: перевернутый ряд с согнутыми коленями

source: cable standing up straight crossovers
ru: прямые кроссоверы на тросе стоя

source: kettlebell alternating press on floor
ru: попеременный жим гири на полу

source: barbell lying close-grip press
ru: жим штанги лежа с близким хватом

source: barbell reverse grip skullcrusher
ru: Жим штанги обратным хватом

source: lever bicep curl
ru: разгибание на бицепс

source: dumbbell seated bicep curl
ru: разгибание гантелей на бицепс сидя

source: barbell standing concentration curl
ru: концентрические разгибания штанги стоя

source: smith one arm row
ru: одноручный ряд Смита

source: dumbbell squat
ru: приседание с гантелями

source: barbell floor calf raise
ru: подъем икроножных на полу со штангой

source: band lying straight leg raise
ru: Подъем прямых ног лежа

source: dumbbell tate press
ru: жим тате с гантелями

source: decline push-up
ru: отжимание от пола

source: band kneeling one arm pulldown
ru: Подтягивания на одной руке с лентой на коленях

source: band front lateral raise
ru: боковой подъем с лентой

source: kneeling lat stretch
ru: разгибание ног в коленях

source: machine inner chest press
ru: Внутренний жим от груди

source: dumbbell forward lunge triceps extension
ru: разгибание трицепса с гантелями вперед

source: leg up hamstring stretch
ru: растяжка подколенных сухожилий

source: box jump down with one leg stabilization
ru: прыжок из бокса вниз со стабилизацией на одной ноге

source: run (equipment)
ru: бег (оборудование)

source: one leg floor calf raise
ru: подъем икры на одну ногу с пола

source: exercise ball back extension with arms extended
ru: Разгибание спины на мяче с вытянутыми руками

source: cable incline pushdown
ru: кабельный наклонный жим

source: ez barbell reverse grip preacher curl
ru: разгибание штанги обратным хватом

source: split squats
ru: сплит-приседания

source: cable overhead curl on exercise ball
ru: Скручивания на мяче для упражнений

source: walking high knees lunge
ru: шагающий выпад с высокими коленями

source: half sit-up (male)
ru: полуприседания (мужчины)

source: weighted russian twist v. 2
ru: Русский твист с отягощением v. 2

source: assisted sit-up
ru: ассистированный присед

source: dumbbell lying external shoulder rotation
ru: внешнее вращение плеч лежа с гантелями

source: dumbbell one arm lateral raise with support
ru: боковой подъем гантели на одну руку с опорой

source: assisted lying leg raise with lateral throw down
ru: вспомогательный подъем ног лежа с боковым выпадом

source: roller reverse crunch
ru: обратный кранч на роликах

source: dumbbell press on exercise ball
ru: Жим гантелей на гимнастическом мяче

source: cable reverse curl
ru: обратное скручивание на тросе

source: sled 45в° leg press (back pov)
ru: жим ногами на санках под углом 45в° (спиной вперед)

source: barbell high bar squat
ru: приседание с высокой штангой

source: cable squatting curl
ru: кабельное приседание

source: smith reverse grip bent over row
ru: Смит обратным хватом наклонный ряд

source: cable upright row
ru: кабельный вертикальный ряд

source: kettlebell one arm clean and jerk
ru: рывок с гирей на одной руке

source: barbell pin presses
ru: жим штанги лежа

source: kettlebell two arm row
ru: гиревой ряд на две руки

source: alternate lateral pulldown
ru: попеременные боковые тяги

source: dumbbell reverse fly
ru: обратный мах гантелей

source: barbell side bent v. 2
ru: боковой прогиб штанги v. 2

source: lever reverse t-bar row
ru: обратный рывок штанги

source: dumbbell seated one leg calf raise - palm up
ru: подъем гантелей на одну ногу - ладонь вверх

source: barbell upright row v. 3
ru: штанга в вертикальном положении v. 3

source: standing calves calf stretch
ru: растяжка икроножных стоя

source: dumbbell standing one arm extension
ru: разгибание одной руки с гантелями

source: twisted leg raise
ru: подъем ног с поворотом

source: weighted tricep dips
ru: трицепс-дипсы с отягощением

source: dumbbell bench press
ru: жим гантелей на скамье

source: dumbbell contralateral forward lunge
ru: Выпады с гантелями вперед

source: kettlebell thruster
ru: рывок гири

source: one arm slam (with medicine ball)
ru: слэп на одной руке (с медицинским мячом)

source: lever one arm lateral high row
ru: Рычаг на одной руке, боковой высокий ряд

source: dumbbell incline fly on exercise ball
ru: Наклонный мах гантелей на гимнастическом мяче

source: biceps leg concentration curl
ru: концентрическое разгибание ног на бицепс

source: resistance band hip thrusts on knees (female)
ru: Тяга резистивной ленты к бедрам на коленях (женщины)

source: lever t-bar reverse grip row
ru: Рычажная тяга штанги обратным хватом

source: cable deadlift
ru: тросовый подъём

source: sled 45° leg press (side pov)
ru: жим ногами на санках под углом 45° (боковой упор)

source: smith leg press
ru: жим ногами Смита

source: exercise ball seated hamstring stretch
ru: растяжка подколенных сухожилий с помощью мяча

source: cable lying triceps extension v. 2
ru: разгибание трицепса лежа на тросе v. 2

source: frankenstein squat
ru: приседание Франкенштейна

source: dumbbell incline shoulder raise
ru: подъем плеч с гантелями в наклоне

source: hyght dumbbell fly
ru: махи гантелей

source: assisted prone lying quads stretch
ru: растяжка квадрицепсов в упоре лежа

source: dumbbell lying supination on floor
ru: супинация гантелей лежа на полу

source: push-up close-grip off dumbbell
ru: отжимание от гантели закрытым хватом

source: dumbbell one arm standing hammer curl
ru: Скручивание гантели на одну руку стоя

source: side hip abduction
ru: боковое отведение бедра

source: cable seated chest press
ru: жим от груди на тросе

source: band reverse wrist curl
ru: обратное скручивание запястья

source: inverted row
ru: перевёрнутый ряд

source: cable standing twist row (v-bar)
ru: Кабельный стоячий скручивающий ряд (v-bar)

source: kettlebell alternating press
ru: попеременный жим гири

source: barbell incline close grip bench press
ru: жим штанги лежа на наклонной скамье с близким хватом

source: barbell lying back of the head tricep extension
ru: жим штанги лежа затылком на трицепс

source: circles knee stretch
ru: круги растяжка колена

source: barbell reverse grip incline bench row
ru: жим штанги обратным хватом на наклонной скамье

source: lever bent-over row with v-bar
ru: Рычажные наклоны с V-образной перекладиной

source: dumbbell seated bent over triceps extension
ru: разгибание трицепса с гантелями в наклоне

source: barbell standing close grip military press
ru: жим штанги стоя с закрытым хватом

source: barbell guillotine bench press
ru: гильотинный жим штанги

source: smith narrow row
ru: узкий ряд Смита

source: dumbbell single leg squat
ru: Приседания с гантелями на одной ноге

source: dumbbell supported squat
ru: приседание с опорой на гантели

source: decline crunch
ru: кранч со снижением

source: barbell close-grip bench press
ru: Жим штанги лежа с закрытыми рукоятками

source: band bent-over hip extension
ru: Разгибание бедра с лентой

source: lying leg-hip raise
ru: подъем бедра лежа

source: dumbbell fly on exercise ball
ru: махи гантелей на гимнастическом мяче

source: leg pull in flat bench
ru: Подтягивание ног на плоской скамье

source: bottoms-up
ru: подтягивания снизу вверх

source: run
ru: бег

source: one arm chin-up
ru: подтягивание на одной руке

source: exercise ball alternating arm ups
ru: попеременные подъемы рук на мяче для упражнений
