Repository: kostya-lee003/Rockout
Catalog: Rockout/Supporting Files/*.lproj/LocalizableExercises.strings
Languages: ru

source: exercise ball on the wall calf raise (tennis ball between knees)
ru: Подъем икроножных на мяче на стене (теннисный мяч между коленями)

source: cable low seated row
ru: Низкая тяга на тросе

source: flexion leg sit up (straight arm)
ru: присед на сгибание ног (прямые руки)

source: triceps dips floor
ru: трицепсовые выпады на пол

source: astride jumps (male)
ru: прыжки с места (мужчины)

source: weighted hanging leg-hip raise
ru: подъем бедра с отягощением

source: hanging straight leg raise
ru: подъем прямых ног в висе

source: wide hand push up
ru: отжимание на широких руках

source: dumbbell lying pullover on exercise ball
ru: разводка гантелей лежа на мяче для упражнений

source: band two legs calf raise - (band under both legs) v. 2
ru: Подъем икроножных на две ноги с лентой - (лента под обеими ногами) v. 2

source: dumbbell one arm seated neutral wrist curl
ru: Скручивание гантелей на одной руке в положении сидя с нейтральным запястьем

source: short stride run
ru: бег короткими шагами

source: dumbbell rear lateral raise
ru: разведение гантелей в стороны

source: cable rope incline tricep extension
ru: разгибание трицепса в наклоне на тросе

source: incline scapula push up
ru: Наклонный жим лопатками

source: smith standing leg calf raise
ru: Смит, подъем ног на носки стоя

source: cable standing pulldown (with rope)
ru: Подтягивания на тросе стоя (с веревкой)

source: jump rope
ru: Скакалка

source: barbell jm bench press
ru: Жим штанги лежа

source: chest dip on straight bar
ru: Наклоны к груди на прямой штанге

source: kettlebell seesaw press
ru: Жим гири на качелях

source: barbell reverse close-grip bench press
ru: Жим штанги лежа с обратным хватом

source: left hook. boxing
ru: Левый крюк. бокс

source: dumbbell seated alternate press
ru: Попеременный жим гантелей сидя

source: barbell standing ab rollerout
ru: Разводка гантелей стоя

source: dumbbell single arm overhead carry
ru: Жим гантелей с одной рукой над головой

source: tire flip
ru: Сальто на шине

source: dumbbell step-up split squat
ru: Приседания с гантелями в наклоне

source: crunch floor
ru: Кранч пол

source: weighted russian twist
ru: русское скручивание с отягощением

source: dumbbell burpee
ru: берпи с гантелями

source: lever seated squat calf raise on leg press machine
ru: Приседания с рычагом сидя, подъем ножек на тренажёре для жима ногами

source: dumbbell decline shrug v. 2
ru: Жим гантелей в наклоне v. 2

source: backward jump
ru: Прыжок назад

source: push and pull bodyweight
ru: толчок и рывок с весом тела

source: dumbbell incline palm-in press
ru: жим гантелей с наклоном ладони внутрь

source: bodyweight standing close-grip row
ru: гребля стоя с закрытым хватом

source: rocking frog stretch
ru: растяжка лягушка-качалка

source: dynamic chest stretch (male)
ru: динамическая растяжка грудной клетки (мужчины)

source: medicine ball supine chest throw
ru: бросок медицинского мяча на грудь в положении лежа

source: cable high row (kneeling)
ru: тросовый жим (стоя на коленях)

source: smith decline bench press
ru: жим лежа со снижением Смита

source: ez barbell curl
ru: эз-скручивание штанги

source: cable one arm press on exercise ball
ru: жим одной рукой на гимнастическом мяче

source: glute-ham raise
ru: подъем ягодиц и бедер

source: dumbbell lateral to front raise
ru: разводка гантелей в стороны

source: dumbbell one arm french press on exercise ball
ru: жим гантели одной рукой на гимнастическом мяче

source: push up on bosu ball
ru: отжимание на мяче босу

source: reverse grip pull-up
ru: подтягивание обратным хватом

source: dumbbell palm rotational bent over row
ru: разводка гантелей с вращением ладони над головой

source: cable pushdown (with rope attachment)
ru: отжимание на тросе (с креплением на веревку)

source: sissy squat
ru: приседание

source: band shoulder press
ru: жим с лентой

source: cable shoulder press
ru: кабельный жим на плечи

source: smith machine bicep curl
ru: разгибание бицепса с помощью машины Смита

source: cable twisting pull
ru: тросовая тяга на скручивание

source: kettlebell extended range one arm press on floor
ru: жим гири на полу в расширенном диапазоне на одощью машины Смита

source: barbell one arm snatch
ru: рывок гири на одной руке

source: air bike
ru: воздушный велосипед

source: barbell seated close-grip concentration curl
ru: концентрическое разгибание штаощью машины Смита

source: lever one arm lateral wide pulldown
ru: Рычаг на одной руке, боковой широкий пулдаун

source: dumbbell seated neutral wrist curl
ru: Скручивание гантели с нейтральным запястьем

source: barbell stiff leg good morning
ru: Жим штанги ногами с добрым утром

source: barbell full squat (side pov)
ru: Приседание со штангой (боковое положение)

source: stability ball crunch (full range hands behind head)
ru: Стабилизирующее скручивание мяча (полная амплитуда рук за головой)

source: dumbbell standing front raise above head
ru: Подъем гантели над головой

source: barbell decline wide-grip pullover
ru: разгибание штанги широким хватом

source: dumbbell alternate side press
ru: попеременный боковой жим гантелей

source: neck side stretch
ru: боковая растяжка шеи

source: dumbbell incline bench press
ru: жим гантелей на наклонной скамье

source: behind head chest stretch
ru: растяжка грудной клетки за головой

source: lever kneeling leg curl
ru: разгибание ног в коленях

source: lever shoulder press v. 2
ru: жим от плеча с рычагом v. 2

source: cable concentration curl
ru: концентрическое скручивание на тросе

source: side push-up
ru: боковое отжимание

source: exercise ball on the wall calf raise (tennis ball between ankles)
ru: разгибание икроножных мышц на мяче у стены (теннисный мяч между лодыжками)

source: cable low fly
ru: низкие махи на тросе

source: flexion leg sit up (bent knee)
ru: присед на согнутых ногах (согнутые колени)

source: triceps dip (between benches)
ru: разводка на трицепс (между скамьями)

source: weighted front raise
ru: подтягивания с отягощением

source: hanging straight leg hip raise
ru: подъем бедра на прямых ногах

source: wide grip rear pull-up
ru: подтягивания широким хватом

source: dumbbell lying pronation on floor
ru: пронация гантелей лежа на полу

source: dumbbell one arm seated hammer curl
ru: Скручивание гантелей на одной руке в приседе

source: semi squat jump (male)
ru: прыжок с полуприседанием (мужчины)

source: dumbbell rear fly
ru: махи гантелей назад

source: cable rope high pulley overhead tricep extension
ru: Разгибание верхнего трицепса на тросе

source: incline reverse grip push-up
ru: Отжимание обратным хватом в наклоне

source: smith standing behind head military press
ru: Военный жим Смита стоя за головой

source: cable standing one leg calf raise
ru: Подъем икры на одной ноге с помощью троса

source: janda sit-up
ru: приседание с грифом Джона

source: barbell jefferson squat
ru: приседание со штангой Джефферсона

source: chest dip (on dip-pull-up cage)
ru: разводка на груди (на клетке для подтягиваний)

source: kettlebell seated two arm military press
ru: гиревой жим сидя на двух руках

source: barbell revers wrist curl v. 2
ru: разгибание запястий со штангой v. 2

source: lean planche
ru: косой ланч

source: dumbbell seated alternate hammer curl on exercise ball
ru: Скручивание гантелей в приседе на мяче для упражнений

source: barbell squat jump step rear lunge
ru: приседание со штангой с прыжковым шагом и задним выпадом

source: dumbbell side plank with rear fly
ru: боковая планка с гантелями и махи назад

source: three bench dip
ru: три наклона к скамье

source: dumbbell step-up lunge
ru: выпад с гантелями

source: crunch (on stability ball, arms straight)
ru: кранч (на мяче для стабильности, руки прямые)

source: weighted round arm
ru: круглые руки с отягощением

source: dumbbell biceps curl v sit on bosu ball
ru: разгибание гантелей на бицепс v сидя на мяче для босу

source: lever seated row
ru: рычажный присед

source: dumbbell decline shrug
ru: разгибание плеч с гантелями

source: pull-up
ru: подтягивания

source: dumbbell incline one arm press on exercise ball
ru: Наклонный жим гантелей одной рукой на гимнастическом мяче

source: bodyweight standing close-grip one arm row
ru: разводка на одной руке с весом тела стоя

source: ring dips
ru: кольцевые выпады

source: dumbbells seated triceps extension
ru: Разгибание трицепса с гантелями в положении сидя

source: medicine ball overhead slam
ru: верхний слэп с медицинским мячом

source: cable high pulley overhead tricep extension
ru: разгибание верхней части трицепса на тросе

source: smith deadlift
ru: мёртвая тяга Смита

source: ez barbell close-grip curl
ru: разгибание штанги для ближнего хвата

source: cable one arm preacher curl
ru: разгибание на одной руке

source: glute bridge two legs on bench (male)
ru: Ягодичный мостик на двух ногах на скамье (мужчина)

source: dumbbell lateral raise
ru: боковой подъем гантелей

source: assisted motion russian twist
ru: русское скручивание с ассистирующим движением

source: dumbbell one arm fly on exercise ball
ru: махи одной рукой с гантелями на гимнастическом мяче

source: pull up (neutral grip)
ru: подтягивания (нейтральный хват)

source: rear pull-up
ru: подтягивание сзади

source: band standing rear delt row
ru: разводка с лентой стоя на задних дельтах

source: dumbbell over bench wrist curl
ru: разгибание запястья с гантелью над скамьей

source: cable pushdown (straight arm) v. 2
ru: Подтягивания на тросе (прямая рука) v. 2

source: band single leg reverse calf raise
ru: обратный подъем икры на одной ноге с лентой

source: single leg squat (pistol) male
ru: приседание на одной ноге (пистолет)

source: smith low bar squat
ru: приседание с низкой штангой Смита

source: cable seated wide-grip row
ru: тросовый присед с широким хватом

source: band one arm standing low row
ru: ленточный жим одной рукой стоя

source: cable twist (up-down)
ru: Скручивания на тросе (вверх-вниз)

source: kettlebell double windmill
ru: гиревая двойная мельница

source: barbell one arm side deadlift
ru: боковой мертвый подъем со штангой на одной руке

source: barbell seated close grip behind neck triceps extension
ru: разгибание трицепса за шею с помощью штанги

source: lever lying two-one leg curl
ru: разгибание ног лежа на двух ногах

source: dumbbell seated lateral raise v. 2
ru: боковой подъем гантелей в приседе v. 2

source: barbell step-up
ru: подтягивание на перекладине

source: squat to overhead reach with twist
ru: приседание с поворотом к верху

source: barbell front chest squat
ru: приседание со штангой на груди

source: dumbbell standing concentration curl
ru: концентрическое скручивание гантелей стоя

source: band horizontal pallof press
ru: горизонтальный жим паллофа с лентой

source: dumbbell alternate seated hammer curl
ru: попеременное разгибание гантелей в приседе

source: band close-grip pulldown
ru: подтягивания на перекладине с близким хватом

source: barbell bent over row
ru: разгибание штанги

source: narrow push-up on exercise ball
ru: узкое отжимание на гимнастическом мяче

source: dumbbell incline alternate press
ru: попеременный жим гантелей с наклоном

source: bear crawl
ru: медвежий кроль

source: lever hip extension v. 2
ru: Разгибание бедра с помощью рычага v. 2

source: lever shoulder press
ru: жим от плеча

source: cable close grip curl
ru: разгибание рук с помощью троса

source: side hip (on parallel bars)
ru: боковое разгибание бедра (на параллельных брусьях)

source: barbell bent arm pullover
ru: разгибание рук со штангой

source: exercise ball on the wall calf raise
ru: разведение икроножных на мяче у стены

source: cable lateral raise
ru: боковой подъем на тросе

source: flag
ru: флаг

source: triceps dip (bench leg)
ru: разводка трицепсов (ноги на скамье)

source: weighted front plank
ru: фронтальная планка с отягощением

source: hanging pike
ru: висячая щука

source: wide grip pull-up
ru: подтягивание широким хватом

source: dumbbell lying pronation
ru: пронация гантелей лежа

source: band underhand pulldown
ru: подтягивания с лентой под мышкой

source: dumbbell one arm seated bicep curl on exercise ball
ru: разгибание гантелей на бицепс на мяче для упртелей лежа

source: self assisted inverse leg curl (on floor)
ru: обратные разгибания ног с самопомощью (на полу)

source: cable rope hammer preacher curl
ru: разгибание молота на тросе

source: dumbbell rear delt row_shoulder
ru: разводка гантелей на задние дельты_плечи

source: incline push-up (on box)
ru: отжимание в наклоне (на боксе)

source: smith standing back wrist curl
ru: разгибание запястья стоя

source: cable standing one arm triceps extension
ru: разгибание трицепса на одной руке на тросе

source: jackknife sit-up
ru: присед с ножом

source: barbell incline shoulder raise
ru: подъем плястья стоя

source: chest dip
ru: наклоны к груди

source: kettlebell seated press
ru: жим гири сидя

source: barbell rear lunge v. 2
ru: задний выпад со штангой v. 2

source: landmine lateral raise
ru: боковой подъем с миной

source: dumbbell seated alternate front raise
ru: попеременные подъемы гантелей спереди

source: barbell squat (on knees)
ru: приседания со штангой (на коленях)

source: barbell full zercher squat
ru: приседание со штангой в полный рост

source: dumbbell side lying one hand raise
ru: боковой подъем гантелей лежа на одной руке

source: suspended row
ru: подвесной ряд

source: dumbbell step-up
ru: подтягивания с гантелями

source: crunch (on stability ball)
ru: кранч (на мяче для устойчивости)

source: weighted muscle up
ru: подъём мышц с отягощением

source: dumbbell biceps curl squat
ru: приседание с гантелями для разгибания на бицепс

source: lever seated reverse fly (parallel grip)
ru: обратные махи с рычагом (параллельный хват)

source: dumbbell decline one arm hammer press
ru: жим гантели с одной рукой

source: pull-in (on stability ball)
ru: подтягивания (на мяче для стабильности)

source: dumbbell incline one arm press
ru: Наклонный жим гантелей одной рукой

source: bodyweight standing calf raise
ru: Подъем икроножных с весом тела

source: reverse plank with leg lift
ru: обратная планка с подъемом ног

source: medicine ball close grip push up
ru: отжимания с медицинским мячом в закрытом хвате

source: cable hammer curl (with rope)
ru: Скручивание молота на тросе (с веревкой)

source: smith close-grip bench press
ru: жим лежа на скамье Смита с близким хватом

source: ez barbell close grip preacher curl
ru: разгибание штанги с близким хватом

source: cable one arm lateral raise
ru: боковой подъем на одной руке

source: glute bridge march
ru: марш-бросок для ягодиц

source: dumbbell kneeling bicep curl exercise ball
ru: разгибание гантелей на бицепс на коленях на мяче

source: assisted pull-up
ru: подтягивание

source: barbell bench press
ru: жим штанги лежа

source: dumbbell one arm decline chest press
ru: жим гантелей от груди на одну руку

source: prone twist on stability ball
ru: Скручивание на мяче для стабильности

source: rear deltoid stretch
ru: растяжка задних дельтовидных мышц

source: dumbbell over bench revers wrist curl
ru: разгибание запястий с гантелями над скамьей

source: cable pushdown
ru: тросовый жим

source: single leg platform slide
ru: Скольжение на платформе на одной ноге

source: cable seated twist
ru: сидячий твист на тросе

source: smith incline bench press
ru: Наклонный жим лежа

source: cable twist
ru: кабельный твист

source: kettlebell double snatch
ru: гиревой двойной рывок

source: barbell one arm floor press
ru: Жим штанги одной рукой от пола

source: barbell seated calf raise
ru: Подъем икры со штангой в приседе

source: lever lying leg curl
ru: разгибание ног лежа

source: dumbbell seated lateral raise
ru: боковой подъем гантелей в приседе

source: barbell standing wide-grip curl
ru: разгибание штанги стоя широким хватом

source: squat to overhead reach
ru: приседание с выходом на верхнюю ступень

source: dumbbell standing calf raise
ru: подъем гантелей на икры стоя

source: dumbbell zottman preacher curl
ru: разгибание гантелей в упоре лежа

source: dumbbell alternate preacher curl
ru: попеременное разгибание гантелей

source: muscle-up (on vertical bar)
ru: подтягивание (на вертикальной перекладине)

source: dumbbell high curl
ru: высокие скручивания с гантелями

source: battling ropes
ru: скакалки

source: lever high row
ru: рычаг высокой тяги

source: lever seated leg raise crunch
ru: Хруст приседаний с подъемом ног

source: cable bench press
ru: жим лежа на тросе

source: side bridge v. 2
ru: боковой мост v. 2

source: exercise ball lying side lat stretch
ru: Упражнение на мяче лежа с боковым разгибанием ног

source: cable lateral pulldown with v-bar
ru: боковые подтягивания на тросе с V-образной перекладиной

source: finger curls
ru: скручивания пальцев

source: swing 360
ru: качели 360

source: weighted drop push up
ru: отжимания с отягощением

source: hanging oblique knee raise
ru: косые подъемы коленей в висе

source: wheel run
ru: бег на колесах

source: dumbbell lying one arm supinated triceps extension
ru: разгибание трицепса с гантелями лежа на одной руке

source: dumbbell one arm reverse spider curl
ru: обратные паучьи скручивания с гантелями на одной руке

source: band standing twisting crunch
ru: скручивания с лентой стоя

source: self assisted inverse leg curl
ru: Самостоятельное обратное разгибание ног

source: dumbbell rear delt raise
ru: Подъем гантелей на задние дельты

source: cable rope extension incline bench row
ru: разгибание троса на наклонной скамье

source: incline push-up
ru: наклонное отжимание

source: smith squat
ru: приседание Смита

source: cable standing lift
ru: тросовый подъем стоя

source: jack jump (male)
ru: прыжок с места (мужчина)

source: barbell incline row
ru: наклонный ряд со штангой

source: barbell incline bench press
ru: Наклонный жим штанги лежа

source: chest and front of shoulder stretch
ru: растяжка груди и передней части плеч

source: kettlebell plyo push-up
ru: отжимание с гирей

source: barbell rear lunge
ru: задний выпад со штангой

source: landmine 180
ru: мина 180

source: dumbbell scott press
ru: жим гантелей Скоттй части плеч

source: barbell split squat v. 2
ru: приседания со штангой в наклоне v. 2

source: dumbbell side bend
ru: боковой сгиб гантели

source: suspended reverse crunch
ru: обратный кранч с подвесом

source: barbell drag curl
ru: разгибание штанги

source: dumbbell step up single leg balance with bicep curl
ru: подтягивания с гантелями на одной ноге с разгибанием на бицепс

source: crunch (hands overhead)
ru: кранч (руки над головой)

source: weighted lunge with swing
ru: выпад с отягощением и махом

source: dumbbell biceps curl reverse
ru: обратные разгибания гантелей на бицепс

source: lever seated reverse fly
ru: обратный мах с приседом

source: dumbbell decline one arm fly
ru: махи одной рукой с гантелями

source: balance board
ru: балансировочная доска

source: power point plank
ru: планка в силовой точке

source: dumbbell incline one arm lateral raise
ru: Наклон гантелей и боковой подъем одной руки

source: bodyweight squatting row (with towel)
ru: приседания с весом тела (с полотенцем)

source: reverse grip machine lat pulldown
ru: подтягивания с обратным хватом

source: medicine ball chest push with run release
ru: Жим от груди с медицинским мячом с разбега

source: cable front shoulder raise
ru: кабельный передний подъем плеч

source: smith chair squat
ru: приседание на стуле Смита

source: ez barbell anti gravity press
ru: жим штанги против силы тяжести

source: cable one arm lateral bent-over
ru: кабельный одноручный боковой наклон

source: gironda sternum chin
ru: подбородок с грудиной

source: assisted standing pull-up
ru: подтягивания стоя

source: dumbbell kickbacks on exercise ball
ru: Выпады с гантелями на гимнастическом мяче

source: prisoner half sit-up (male)
ru: полуприседание с заключенным (мужчины)

source: dumbbell one arm concentration curl (on stability ball)
ru: концентрическое скручивание гантелей на одной руке (на мяче для стабильности)

source: band v-up
ru: подъем с лентой

source: assisted lying glutes stretch
ru: растяжка ягодиц лежа

source: rear decline bridge
ru: задний мостик

source: arms apart circular toe touch (male)
ru: разведение рук в стороны, круговое касание пальцами ног (мужчины)

source: dumbbell over bench one arm wrist curl
ru: разгибание рук с гантелями над скамьей

source: cable pulldown bicep curl
ru: разгибание бицепса на тросе

source: single leg calf raise (on a dumbbell)
ru: подъем икры на одну ногу (с гантелью)

source: band shrug
ru: плечи

source: band one arm twisting chest press
ru: Жим от груди на одной руке

source: cable seated shoulder internal rotation
ru: Внутреннее вращение плеч в приседе на тросе

source: smith hip raise
ru: подъем бедра по Смиту

source: cable tuck reverse crunch
ru: обратный кранч на тросе

source: kettlebell double push press
ru: двойной жим гири

source: barbell one arm bent over row
ru: Штанга на одной руке в наклоне

source: lever leg extension
ru: разгибание ног

source: dumbbell seated kickback
ru: разводка гантелей в приседе

source: barbell standing wide military press
ru: Широкий военный жим со штангой

source: squat on bosu ball
ru: приседание на мяче босу

source: barbell front raise
ru: фронтальный подъем штанги

source: dumbbell standing biceps curl
ru: разгибание гантелей на бицепс стоя

source: barbell decline close grip to skull press
ru: Жим штанги лёжа с близким хватом к черепу

source: dumbbell zottman curl
ru: разгибание гантели в зотмане

source: dumbbell alternate hammer preacher curl
ru: попеременное разгибание гантелей

source: lever seated hip abduction
ru: Разведение бедер с рычагом в положении сидя

source: muscle up
ru: Выход силой

source: dumbbell hammer curls (with arm blaster)
ru: Скручивания гантелей (с армбластером)

source: basic toe touch (male)
ru: базовое касание пальцев ног (мужчины)

source: lever hammer grip preacher curl
ru: разгибание рычага молотковым хватом

source: lever seated leg curl
ru: разгибание ног с сидячим рычагом

source: cable bar lateral pulldown
ru: боковые подтягивания на тросовой перекладине

source: seated side crunch (wall)
ru: сидячий боковой кранч (у стены)

source: exercise ball lower back stretch (pyramid)
ru: растяжка нижней части спины на мяче (пирамида)

source: cable lateral pulldown (with rope attachment)
ru: боковые тяги на тросе (с креплением на веревке)

source: farmers walk
ru: ходьба фермера

source: swimmer kicks v. 2 (male)
ru: плавательные носки v. 2 (мужчины)

source: weighted donkey calf raise
ru: подъем икроножных с отягощением

source: hanging leg raise
ru: подъем ног в висе

source: wheel rollerout
ru: выкатывание колеса

source: dumbbell lying one arm rear lateral raise
ru: разведение гантелей в упоре лежа на одной руке

source: dumbbell one arm reverse preacher curl
ru: обратные разгибания гантелей на одной руке

source: dumbbell raise
ru: подъём гантелей

source: cable rope elevated seated row
ru: подъемы на тросе в приседе

source: incline push up depth jump
ru: Прыжок в глубину с наклоном

source: cable standing inner curl
ru: кабельное стоячее внутреннее скручивание

source: smith sprint lunge
ru: спринтерский выпад Смита

source: chair leg extended stretch
ru: разгибание ног на стуле

source: kettlebell pistol squat
ru: приседания с гирями

source: barbell rear delt row
ru: разводка задних дельт со штангой

source: l-sit on floor
ru: l-sit на полу

source: dumbbell rotation reverse fly
ru: обратный мах с гантелями

source: barbell speed squat
ru: скоростное приседание со штангой

source: dumbbell shrug
ru: жим гантелей

source: suspended push-up
ru: отжимание в подвешенном состоянии

source: dumbbell standing zottman preacher curl
ru: Скручивание гантелей стоя в проповеднике Зоттмана

source: cross body crunch
ru: кросс-боди кранч
